# ReferenceArray Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferenceArray Constructor
ReferenceArray Class See Also
---
Initializes a new instance of the ReferenceArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ReferenceArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ReferenceArray()
```

# See Also
ReferenceArray Class
Autodesk.Revit.DB Namespace